---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbSwapOut
source: html/bff282fd-c9bd-3bbe-5f97-1ea02490294f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabDbSwapOut Property

Fabrication Database reload could not swap out for newer parts.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabDbSwapOut { get; }
```